/**********************************************************************************
*
*             ***     **      **   **     ******
*             ***     **     **    **   ***   ***
*            ****     **     **   **   **      **
*           ** **     **    **    **  **       **
*          *** **     **   **     **  **
*          **  **     **   **    **  **
*         **   **     **  **     **  **
*        ***   **     ** **      **  **
*        ********     ** **     **   **      **
*       **     **     ****      **   **     **
*      **      **     ***       **   ***   **
*      **      **     ***      **     ******
*
**********************************************************************************
*
* 文件名称:   DataObtainIO
*
* 文件日期:   REDACTED
*
*
* 程序版本:   V1.00
*
**********************************************************************************
*
* 功能说明:
*
*
*********************************************************************************/
#ifndef DATAOBTAINIO_

#define DATAOBTAINIO_

/***************************************************************************/
#define IO_DATA_NUM                         (10U)    /* 离散量数据个数            */
#define IO_CPLD_DATA_NUM                    (10U)    /* 从CPLD采集的离散量个数 */
#define IO_GPIO_DATA_NUM                    (0U)     /* 从GPIO采集的离散量个数 */

/* 离散量芯片1数据bit0-15 */
#define IO_DINDEX_LEFT_JYF               (0U)     	/* 0离散量 吊舱加油阀开状态信号        */
#define IO_DINDEX_LEFT_HYF              (1U)     	/* 1离散量 吊舱回油阀开状态信号            */
#define IO_DINDEX_LEFT_DCZW             (2U)    	/* 2离散量 吊舱在位信号               */
#define IO_DINDEX_POWER_28V            (3U)     	/* 3离散量 28V掉电检测信号   */
#define IO_DINDEX_RIGHT_JYF              (4U)     	/* 4离散量 吊舱加油阀开状态信号        */
#define IO_DINDEX_RIGHT_HYF              (5U)     	/* 5离散量 吊舱回油阀开状态信号            */
#define IO_DINDEX_RIGHT_DCZW           (6U)     	/* 6离散量 吊舱在位信号               */
#define IO_DINDEX_MAINTANCE         	(7U)     	/* 7离散量 地面维护开关信号  */
#define IO_DINDEX_CH_1       				(8U)    /* 8离散量 通道号识别信号1 */
#define IO_DINDEX_CH_2       				(9U)    /* 9离散量 通道号识别信号2 */

/***************************************************************************/
/* 开关状态标志 */
#define IO_STATE_INVALID       (0U)         /* 开关状态无效  */
#define IO_STATE_VALID         (1U)         /* 开关状态有效  */

/***************************************************************************/
/* 离散量采集相关结构体 */

typedef struct _IoData                      /* 离散量数据结构体     */
{
    Uint16 validState_u16;                      /* 当前有效的IO引脚状态 */
    Uint16 currState_u16;                       /* 当前采集的IO引脚状态 */
    Uint16 count_u16;                           /* IO引脚状态保存计数   */

}IoData_t;

/************************************/

typedef struct _IoDataConf                  /* 离散量配置结构体 */
{
    Uint16 initState_u16;                       /* 初始状态                     */
    Uint16 CPLDAddr_u16;                        /* 采集CPLD地址              */
    Uint16 dataBitNum_u16;                      /* IO对应数据位号           */
    Uint16 validCount_u16;                      /* IO状态滤波计数           */

}IoDataConf_t;

/***************************************************************************/
/* 外部调用函数接口 */

extern void   IoDataObtain(void);
extern Uint16 IoDataGet(Uint16 v_index_u16);
extern void   IoDataInit(void);

#endif

//===============================================================================
//END OF FILE
//===============================================================================
