/**********************************************************************************
 *
 *             ***     **      **   **     ******
 *             ***     **     **    **   ***   ***
 *            ****     **     **   **   **      **
 *           ** **     **    **    **  **       **
 *          *** **     **   **     **  **
 *          **  **     **   **    **  **
 *         **   **     **  **     **  **
 *        ***   **     ** **      **  **
 *        ********     ** **     **   **      **
 *       **     **     ****      **   **     **
 *      **      **     ***       **   ***   **
 *      **      **     ***      **     ******
 *
 **********************************************************************************
 *
 * 文件名称:    APP_Config.h
 *
 * 文件日期：       REDACTED
 *
 *
 * 程序版本:   V0.0.1.3
 *
 **********************************************************************************
 *
 * 功能说明:    软件版本宏定义配置
 *
 *    根据顶层要求，软件版本按照4段码（第1段.第2段.第3段.第4段）进行管理，S阶段初始版本为0.0.1.0，软件版本用Uint16类型数据管理，四段码分别占2-3-3-8个Bit
 *
 *
 *********************************************************************************/

#ifndef APP_CONFIG_

#define APP_CONFIG_

#define DSP_SOFT_VERSION4          (1U)    /* 软件版本第4段，用于C阶段软件版本和S阶段的软件小版本管理   */
#define DSP_SOFT_VERSION3          (0U)    /* 软件版本第3段，1代表S阶段        */
#define DSP_SOFT_VERSION2          (0U)    /* 软件版本第2段，1代表定型阶段   */
#define DSP_SOFT_VERSION1          (0U)    /* 软件版本第1段，1代表鉴定阶段   */

struct SoftwVDataBit{ /* 软件版本，例如软件等级：0.0.1.0 */
	Uint16 soft_version4:8U; /* 软件版本第4段，bit0-bit7   */
	Uint16 soft_version3:3U; /* 软件版本第3段，bit8-bit10  */
	Uint16 soft_version2:3U; /* 软件版本第2段，bit11-bit13 */
	Uint16 soft_version1:2U; /* 软件版本第1段，bit14-bit15 */
};

union SoftwVData{
	Uint16 all;
	struct SoftwVDataBit bit;
};

#endif /* end of include guard: APP_CONFIG_ */

/* ========================================================================== */
/* END OF FILE */
/* ========================================================================== */
